luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxXbar_bf.h
/** \brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ONE3 */
#define IFX_XBAR_ARBITER2_DBMADD_ONE3_OFF (30u)

/** \brief  Length for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_LEN (29u)

/** \brief  Mask for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_MSK (0x1fffffffu)

/** \brief  Offset for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_OFF (2u)

/** \brief  Length for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_LEN (29u)

/** \brief  Mask for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_MSK (0x1fffffffu)

/** \brief  Offset for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_OFF (2u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_LEN (25u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_MSK (0x1ffffffu)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS0_OFF (2u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_LEN (3u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_MSK (0x7u)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS1_OFF (28u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBADD_ONE0_OFF (27u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBADD_ONE1_OFF (31u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS0_LEN (25u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS0_MSK (0x1ffffffu)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS0_OFF (2u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS1_LEN (3u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS1_MSK (0x7u)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS1_OFF (28u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE0_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE0_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE0_OFF (27u)

/** \brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE1_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE1_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER6_DBMADD_ONE1_OFF (31u)

/** \brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_LEN (19u)

/** \brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_MSK (0x7ffffu)

/** \brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS0_OFF (2u)

/** \brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS1_OFF (29u)

/** \brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS0_LEN (19u)

/** \brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS0_MSK (0x7ffffu)

/** \brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS0_OFF (2u)

/** \brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS1_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS1_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS1_OFF (29u)

/** \brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE0_LEN (8u)

/** \brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE0_MSK (0xffu)

/** \brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE0_OFF (21u)

/** \brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE1_LEN (2u)

/** \brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE1_MSK (0x3u)

/** \brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER7_DBMADD_ONE1_OFF (30u)

/** \brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_LEN (19u)

/** \brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_MSK (0x7ffffu)

/** \brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS0 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS0_OFF (2u)

/** \brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS1 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS1_OFF (29u)

/** \brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE0 */
#define IFX_XBAR_ARBITER8_DBADD_ONE0_OFF (21u)

/** \brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ONE1 */
#define IFX_XBAR_ARBITER8_DBADD_ONE1_LEN (1u)

