luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxXbar_bf.h
/** \brief  Length for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_LEN (1u)

/** \brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_OFF (4u)

/** \brief  Length for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_LEN (1u)

/** \brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_OFF (6u)

/** \brief  Length for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_LEN (1u)

/** \brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_OFF (7u)

/** \brief  Length for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_LEN (1u)

/** \brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_OFF (8u)

/** \brief  Length for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_LEN (1u)

/** \brief  Mask for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_OFF (15u)

/** \brief  Length for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_LEN (8u)

/** \brief  Mask for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_MSK (0xffu)

/** \brief  Offset for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_OFF (16u)

/** \brief  Length for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_LEN (8u)

/** \brief  Mask for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_MSK (0xffu)

/** \brief  Offset for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_OFF (24u)

/** \brief  Length for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_LEN (4u)

/** \brief  Mask for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_MSK (0xfu)

/** \brief  Offset for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_OFF (4u)

/** \brief  Length for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_OFF (0u)

/** \brief  Length for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_OFF (2u)

/** \brief  Length for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_LEN (8u)

/** \brief  Mask for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_MSK (0xffu)

/** \brief  Offset for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_OFF (8u)

/** \brief  Length for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_LEN (1u)

/** \brief  Mask for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_OFF (1u)

/** \brief  Length for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_LEN (32u)

/** \brief  Mask for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_OFF (0u)

/** \brief  Length for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_LEN (1u)

/** \brief  Mask for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_EXTCOND_Bits.FREQDISF */
#define IFX_XBAR_EXTCOND_FREQDISF_OFF (6u)

/** \brief  Length for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_LEN (7u)

/** \brief  Mask for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_MSK (0x7fu)

/** \brief  Offset for Ifx_XBAR_EXTCOND_Bits.MAX_WS */
#define IFX_XBAR_EXTCOND_MAX_WS_OFF (13u)

/** \brief  Length for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_LEN (1u)

/** \brief  Mask for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_EXTCOND_Bits.NODELTR */
#define IFX_XBAR_EXTCOND_NODELTR_OFF (9u)

/** \brief  Length for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_LEN (1u)

/** \brief  Mask for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_EXTCOND_Bits.NORMW */
#define IFX_XBAR_EXTCOND_NORMW_OFF (10u)

/** \brief  Length for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_LEN (1u)

/** \brief  Mask for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_EXTCOND_Bits.WFWD */
#define IFX_XBAR_EXTCOND_WFWD_OFF (3u)

/** \brief  Length for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_XBAR_ID_Bits.MOD_REV */
#define IFX_XBAR_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_XBAR_ID_Bits.MOD_TYPE */
#define IFX_XBAR_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_OFF (16u)

