luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxXbar_bf.h
/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_OFF (26u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_OFF (27u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_OFF (28u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI13 */
#define IFX_XBAR_IDINTEN_ENMCI13_OFF (29u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_OFF (20u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_OFF (21u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_OFF (22u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_OFF (24u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_OFF (25u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_OFF (0u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_OFF (1u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_OFF (2u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_OFF (4u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI6 */
#define IFX_XBAR_IDINTEN_ENSCI6_OFF (6u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI7 */
#define IFX_XBAR_IDINTEN_ENSCI7_OFF (7u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI8 */
#define IFX_XBAR_IDINTEN_ENSCI8_OFF (8u)

/** \brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCID */
#define IFX_XBAR_IDINTEN_ENSCID_OFF (15u)

/** \brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI0 */
#define IFX_XBAR_IDINTSAT_IDCSCI0_OFF (0u)

/** \brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI1 */
#define IFX_XBAR_IDINTSAT_IDCSCI1_OFF (1u)

/** \brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_MSK (0x1u)

/** \brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDCSCI2 */
#define IFX_XBAR_IDINTSAT_IDCSCI2_OFF (2u)

/** \brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDCSCI4 */
#define IFX_XBAR_IDINTSAT_IDCSCI4_LEN (1u)

/** \brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDCSCI4 */
#define IFX_XBAR_IDINTSAT_IDCSCI4_MSK (0x1u)

